Q1. List any five functions of the pandas library with execution.

In [58]:
import pandas as pd

data = {"name":['a','b','c','d'],"age":[12,34,56,78],"location":['surat','ahmedabad','vadodara','rajkot']}

df = pd.DataFrame(data)

df.head()

  name  age   location
0    a   12      surat
1    b   34  ahmedabad
2    c   56   vadodara
3    d   78     rajkot

In [59]:
df[df.dtypes[df.dtypes == 'object'].index]

  name   location
0    a      surat
1    b  ahmedabad
2    c   vadodara
3    d     rajkot

In [60]:
pd.Categorical(df['location'])

['surat', 'ahmedabad', 'vadodara', 'rajkot']
Categories (4, object): ['ahmedabad', 'rajkot', 'surat', 'vadodara']

In [61]:
df[df.dtypes[df.dtypes == 'object'].index].describe()

       name location
count     4        4
unique    4        4
top       a    surat
freq      1        1

In [62]:
df.loc[0:2,["name",'location']]    #loc must use with index number

  name   location
0    a      surat
1    b  ahmedabad
2    c   vadodara

In [63]:
df.iloc[0:1][['age']]

   age
0   12

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [64]:
df1 = pd.DataFrame({'A':[12,23,45],'B':[9,87,65],'C':[34,56,77]})
df1

    A   B   C
0  12   9  34
1  23  87  56
2  45  65  77

In [65]:
df1.reindex([2*i+1 for i in range(df1.shape[0])])

      A     B     C
1  23.0  87.0  56.0
3   NaN   NaN   NaN
5   NaN   NaN   NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [66]:
df3 = pd.DataFrame({'values':[10, 20, 30, 40, 50]})

In [67]:
a = 0
for index,row in df3.iterrows():
    if index < 3:
        a = a + row['values']
    else:
        break
print(a)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [68]:
df4 = pd.DataFrame({'Text':['abcd','dcf','rtyui','plkmki']})

In [69]:
df4['Word_Count'] = [len(df4['Text'][i]) for i in range(df4.shape[0])]

In [70]:
df4

     Text  Word_Count
0    abcd           4
1     dcf           3
2   rtyui           5
3  plkmki           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size()

Return an int representing the number of elements in this object.

Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.

DataFrame.shape()

Return a tuple representing the dimensionality of the DataFrame.

In [71]:
df4.size , df4.shape

(8, (4, 2))

Q6. Which function of pandas do we use to read an excel file?

In [72]:
pd.read_excel('LUSID Excel - Setting up your market data.xlsx')

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,Getting Started tutorials,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,Knowledge Base articles,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,or Contact us,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,LUSID accepts datetimes in any recognised Exce...,NaN,NaN,"LUSID also accepts UTC, UTS offsets and cutlabels",NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,Excel formats to show datetime,NaN,NaN,Additional formats,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,Enter the date to convert,2019-04-10 00:00:00,NaN,Standard UTC timestamp:,"""YYYY-MM-DDTHH:MM:SS.00Z""","Where Z indicates Zulu time (UTC+0), and is eq..."
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,This date has no time component,2019-04-10 00:00:00,NaN,Convert date into a string,2019-04-10T 13:30:45.55Z,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,Specify time component,13:30:45.550000,NaN,UTC offset (not recognised as an excel date),2019-04-10T13:30:45+04:00,NaN
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,NaN,NaN,NaN,NaN,Add to your date and display the complete date...,2019-04-10 13:30:45.550000,NaN,Cutlabel,2019-04-10NSingaporeClose,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,Although the date can still appears without time,2019-04-10 13:30:45.550000,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,NaN,NaN,NaN,Add an hour to your datetime,2019-04-10 14:30:45.550000,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,NaN,Subtract a minute from your datetime,2019-04-10 14:29:45.550000,NaN,NaN,NaN,NaN

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [73]:
df5 = pd.DataFrame({'Email':['kishan@gmail.com','rem@parul.com','tuy@hmail.com']})

In [74]:
for i in  range(df5.shape[0]):
    print(df5['Email'][i].split(sep='@')[0])

kishan
rem
tuy

In [75]:
df5['Username'] = [df5['Email'][i].split(sep='@')[0] for i in range(df5.shape[0])]

In [76]:
df5

              Email Username
0  kishan@gmail.com   kishan
1     rem@parul.com      rem
2     tuy@hmail.com      tuy

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [77]:
df6 = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [78]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [79]:
df6[(df6['A'] > 5) & (df6['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate

In [80]:
df7 = pd.DataFrame({'values':[10, 20, 30, 40, 50]})

In [81]:
df7['values'].mean()

30.0

In [82]:
df7['values'].median()

30.0

In [83]:
df7['values'].std()

15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [84]:
df8 = pd.DataFrame({'Sales':[10, 20, 30, 40, 50],'Date':pd.to_datetime(['2018/02/01','2019/05/01','2023/07/08','2023/07/01','2023/07/10'])})

In [85]:
df8

   Sales       Date
0     10 2018-02-01
1     20 2019-05-01
2     30 2023-07-08
3     40 2023-07-01
4     50 2023-07-10

In [86]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   5 non-null      int64
 1   Date    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 208.0 bytes

In [87]:
import datetime
t = datetime.datetime.today()
t

datetime.datetime(2023, 7, 12, 10, 48, 50, 857396)

In [88]:
a = 0
df8['days'] = (t - df8['Date']).dt.days

In [89]:
df8

   Sales       Date  days
0     10 2018-02-01  1987
1     20 2019-05-01  1533
2     30 2023-07-08     4
3     40 2023-07-01    11
4     50 2023-07-10     2

In [92]:
import numpy as np
df8['MovingAverage'] = [np.average(df8['Sales'][0:i+1]) if df8['days'][i] < 7 else 0 for i in range(df.shape[0]+1)]

In [93]:
df8

   Sales       Date  days  MovingAverage
0     10 2018-02-01  1987            0.0
1     20 2019-05-01  1533            0.0
2     30 2023-07-08     4           20.0
3     40 2023-07-01    11            0.0
4     50 2023-07-10     2           30.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [94]:
df9 = pd.DataFrame({'Date':pd.to_datetime(['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'])})

In [95]:
df9

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [110]:
df9['Weekday'] = df9['Date'].dt.day_name()

In [111]:
df9

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [112]:
df10 = pd.DataFrame({'Date':pd.to_datetime(['2023-01-01 00:50:00','2023-02-01 12:50:00','2023-01-31 05:50:00','2023-01-04 13:50:00','2023-01-30 23:50:00'])})

In [116]:
df10[(df10['Date'] > '2023-01-01') & (df10['Date'] < '2023-01-31')]

                 Date
0 2023-01-01 00:50:00
3 2023-01-04 13:50:00
4 2023-01-30 23:50:00

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

numpy library, matplotlib library, pd.read_csv('') , pd.DataFrame({}) , pd.to_datetime([]). it is is the first and foremost necessary library that needs to be imported.